// char 字符串名[整数常量]

/*
编写一个程序来实现群发打招呼的功能
首先接收用户输入的想要打招呼的总人数n
然后根据用户每次输入的中文名name,打印出对应的打招呼内容
在打完所有招呼后，要输出“你已经打完所有招呼！”的提示信息
注：打招呼内容固定为：<中文名>，你好
*/

#include<stdio.h>
int main(){
    // 中文字一个字符常占用三个字节
    // 输入时带有空格，scanf第一次只会读取空格前的内容，第二次再读取空格后的内容
    char name[20];
    int n;
    printf("请输入想要打招呼的总人数：\n");
    scanf("%d",&n);

    for(int i=1;i<=n;i++){
        printf("请输入想要打招呼的中文名：（不超过5个汉字）\n");
        // %9s代表读取前九个字节长度的字符串，加上一个空字符总共10
        scanf("%15s",name);
        printf("<%s>,你好！\n",name);
    }
}